       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC 9(7)V99.
       PROCEDURE DIVISION.
           DISPLAY "DEMO".
           STOP RUN.
